<?php

namespace App\Console\Commands;

use App\Models\Station;
use Illuminate\Console\Command;

class MapCreator extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'make:map';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Command description';

    /**
     * Execute the console command.
     *
     * @return int
     */
    public function handle()
    {
        $stations = [
            ["lang"=> 41.9316838231017, "long"=> 41.9883291656222, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "ოზურგეთი","type"=> "საკუთარი", "number"=> "#2-F" ],
            ["lang"=> 41.6415303190807, "long"=> 42.9801259568004, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "ახალციხე","type"=> "საკუთარი", "number"=> "#7-F" ],
            ["lang"=> 42.4031933934165, "long"=> 42.3666122610178, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "მარტვილი","type"=> "საკუთარი", "number"=> "#8-F" ],
            ["lang"=> 41.5540550279790, "long"=> 41.5651856175597, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "ბათუმი","type"=> "საკუთარი", "number"=> "#22-F" ],
            ["lang"=> 41.6494936751923, "long"=> 41.6641171352399, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "ბათუმი","type"=> "საკუთარი", "number"=> "#24-F" ],
            ["lang"=> 41.4868602241804, "long"=> 44.7982565431873, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "მარნეული","type"=> "საკუთარი", "number"=> "#11-F" ],
            ["lang"=> 41.6992789539504, "long"=> 44.8527201034304, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#13-F" ],
            ["lang"=> 41.4868324593325, "long"=> 44.7982555404123, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "მარნეული","type"=> "საკუთარი", "number"=> "#17-F" ],
            ["lang"=> 41.5935549167780, "long"=> 42.8244218666155, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "ადიგენის რ-ნი","type"=> "საკუთარი", "number"=> "#6-F" ],
            ["lang"=> 41.6471025313074, "long"=> 42.8402506564727, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "ადიგენის რ-ნი","type"=> "საკუთარი", "number"=> "#25-F" ],
            ["lang"=> 41.7532760772244, "long"=> 44.7888756212135, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#14-F" ],
            ["lang"=> 41.7294989867572, "long"=> 44.8270942327705, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი" ,"type"=> "საკუთარი", "number"=> "#15-F" ],
            ["lang"=> 41.5749267438178, "long"=> 44.9577291149776, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "რუსთავი" ,"type"=> "საკუთარი", "number"=> "#18-F" ],

            ["lang"=> 41.6824391215882, "long"=> 44.8250261134364, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#1" ],
            ["lang"=> 41.7993979326802, "long"=> 44.7699983916750, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#2" ],
            ["lang"=> 41.7358540603101, "long"=> 44.7739472622826, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#3" ],
            ["lang"=> 41.7626672564162, "long"=> 44.7689573455266, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#4" ],
            ["lang"=> 41.6895093475834, "long"=> 44.9152116691006, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#5" ],
            ["lang"=> 41.6823067616058, "long"=> 44.8249991433974, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#6" ],
            ["lang"=> 41.7255717899599, "long"=> 44.7837978691943, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#7" ],
            ["lang"=> 41.7232153582136, "long"=> 44.7456761751463, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#8" ],
            ["lang"=> 41.7503310797844, "long"=> 44.7700128016467, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#9" ],
            ["lang"=> 41.7863224556204, "long"=> 44.8008180062033, "address"=> 'თბილისი გოთუას მიმდებარე ტერიტორია', "city"=> "თბილისი","type"=> "საკუთარი", "number"=> "#10" ],
        ];

        foreach ($stations as $station) {
            Station::create($station);
        }

        return 0;

    }
}
