<x-layout>
    <x-navbar></x-navbar>
    <x-page-content>
        <div class="w-11/12 h-20 lg:w-3/5 bg-gray-100 flex justify-start items-center p-4">
            <p class="text-xl text-lk-main font-semibold">{{__('about_us')}}</p>
        </div>
        <div class="w-11/12 lg:w-3/5 h-auto mt-8">
            <p class="text-md text-black">
                ლუკოილი მსოფლიოში ერთ-ერთი უმსხვილესი ნავთობისა და გაზის კომპანიაა,
რომელსაც ეკუთვნის ნედლი წარმოების 2%-ზე მეტი და გლობალურად
ნახშირწყალბადების დადასტურებული მარაგების დაახლოებით 1%. <br><br>
ლუკოილის პირველი ავტოგასამართი სადგური საქართველოში 2002 წელს
გაიხსნა. მას შემდეგ კომპანია მუდმივად ვითარდება, დღეს კი ქვეყნის თითქმის
ყველა რეგიონში 60-ზე მეტ ავტოგასამართ სადგურსა და 500-მდე დასაქმებულს
აერთიანებს. <br><br>
ლუკოილ ჯორჯია გახდა პირველი ნავთობკომპანია საქართველოში, რომელმაც
2008 წელს მომხმარებელს ევრო5 სტანდარტის შესაბამისი საწვავი შესთავაზა.
დღესდღეობით ლუკოილის ავტოგასამართ სადგურებზე შემდეგი საწვავების
რეალიზაცია მიმდინარეობს: ექტო 100, RON-98 (სუპერი), RON-95 (პრემიუმი),
RON-92 (ევრო-რეგულარი) და დიზელის საწვავი (ევრო). <br><br>
პროდუქცია ქალაქ ბურგასის ლუკოილის ნავთობგადამამუშავებელი ქარხნიდან
შემოდის, ძრავის ზეთები კი — ვოლგოგრადის ნავთობგადამამუშავებელი
ქარხნიდან. იმისათვის, რომ პროდუქტმა თავისი თვისებები შეინარჩუნოს,
დამზადების ყველა ეტაპზე — ტრანსპორტირებისას, შენახვისას და
ნავთობპროდუქტების რეალიზაციისას, იგი ხარისხის კონტროლს გადის
სერტიფიცირებულ ლაბორატორიებში. შემოწმების შემდგომ თითოეულ
პროდუქტზე გაიცემა ხარისხის დამადასტურებელი დოკუმენტი, რომელიც ყველა
მიღებულ სტანდარტთან შესაბამისობაზე მიუთითებს. <br><br>
ლუკოილის საწვავს ემატება უნიკალური დანამატი ექტო, რომელსაც შეუძლია
ძრავის მუშაობის მახასიათებლების გაუმჯობესება და გარემოს აგრესიული
ზემოქმედებისგან უფრო ეფექტიანი დაცვა. ექტო საქართველოში
გაუმჯობესებული საექსპლუატაციო და ეკოლოგიური თვისებების მქონე
პირველი საწვავი გახდა. <br><br>
საწვავის დანამატი ექტო ამცირებს საწვავის ხარჯს და აუმჯობესებს აჩქარების
დინამიკას. მისი გამოყენება უსაფრთხოა ატმოსფერული და ტურბო დაბერვის
მქონე ძრავებისთვის და სრულად აკმაყოფილებს საერთაშორისო საავტომობილო
ფედერაციისა (FIA) და მოტოსპორტის საერთაშორისო ფედერაციის
(FIM)მოთხოვნებს.
            </p>
        </div>
    </x-page-content>
    <x-footer></x-footer>
</x-layout>
